In [1]:
import pandas as pd

### 인공지능 반

In [19]:
# 딕셔너리로 데이터 프레임 만들기
df1 = pd.DataFrame(data={
    "진로희망" : ['빅데이터분석가', '자영업','웹개발자','대학원','합계'],
    "도수" : [7,6,4,3,20]
    
})

In [20]:
df1

      진로희망  도수
0  빅데이터분석가   7
1      자영업   6
2     웹개발자   4
3      대학원   3
4       합계  20

### 빅데이터 반

In [21]:
df2 = pd.DataFrame(data={
    "진로희망" : ['빅데이터분석가', '자영업','웹개발자','대학원','합계'],
    "도수" : [12,14,10,14,50]
})

In [22]:
df2

      진로희망  도수
0  빅데이터분석가  12
1      자영업  14
2     웹개발자  10
3      대학원  14
4       합계  50

### 데이터프레임 병합

In [31]:
df_concat = pd.concat([df1,df2["도수"]],axis=1)
df_concat.columns=['진로희망', '인공지능반','빅데이터반']

In [46]:
df_concat

      진로희망  인공지능반  빅데이터반  인공지능반 상대 도수  빅데이터반 상대 도수
0  빅데이터분석가      7     12         0.35         0.24
1      자영업      6     14         0.30         0.28
2     웹개발자      4     10         0.20         0.20
3      대학원      3     14         0.15         0.28
4       합계     20     50         1.00         1.00

### 상대도수 데이터 프레임 만들기

In [47]:
df_concat['인공지능반 상대 도수']=df_concat.loc[:,'인공지능반']/20

In [48]:
df_concat['빅데이터반 상대 도수']=df_concat.loc[:,'빅데이터반']/50

In [49]:
df_concat

      진로희망  인공지능반  빅데이터반  인공지능반 상대 도수  빅데이터반 상대 도수
0  빅데이터분석가      7     12         0.35         0.24
1      자영업      6     14         0.30         0.28
2     웹개발자      4     10         0.20         0.20
3      대학원      3     14         0.15         0.28
4       합계     20     50         1.00         1.00

In [ ]:
df_list = pd.DataFrame([[6/20,12/50],
                        [7/20,14/50],
                        [3/20,10/50],
                        [3/20,14/50]])